burakenez/gd32m53x-cmake-vscode/Examples/EVIC/cmp_trigger_group_intput_capture/GD32M53x.svd
        <register>
          <name>CHSEL0</name>
          <displayName>CHSEL0</displayName>
          <description>Channel selection register 0</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GP2CH6</name>
              <description>Select channel ADCx_IN06 in Group_pri2</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP2CH5</name>
              <description>Select channel ADCx_IN05 in Group_pri2</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP2CH4</name>
              <description>Select channel ADCx_IN04 in Group_pri2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP2CH3</name>
              <description>Select channel ADCx_IN03 in Group_pri2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP2CH2</name>
              <description>Select channel ADCx_IN02 in Group_pri2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP2CH1</name>
              <description>Select channel ADCx_IN01 in Group_pri2</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP2CH0</name>
              <description>Select channel ADCx_IN00 in Group_pri2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP1CH6</name>
              <description>Select channel ADCx_IN06 in Group_pri1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP1CH5</name>
              <description>Select channel ADCx_IN05 in Group_pri1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP1CH4</name>
              <description>Select channel ADCx_IN04 in Group_pri1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP1CH3</name>
              <description>Select channel ADCx_IN03 in Group_pri1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP1CH2</name>
              <description>Select channel ADCx_IN02 in Group_pri1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP1CH1</name>
              <description>Select channel ADCx_IN01 in Group_pri1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP1CH0</name>
              <description>Select channel ADCx_IN00 in Group_pri1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHSEL1</name>
          <displayName>CHSEL1</displayName>
          <description>Channel selection register 1</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GP4CH6</name>
              <description>Select channel ADCx_IN06 in Group_pri4</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP4CH5</name>
              <description>Select channel ADCx_IN05 in Group_pri4</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP4CH4</name>
              <description>Select channel ADCx_IN04 in Group_pri4</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP4CH3</name>
              <description>Select channel ADCx_IN03 in Group_pri4</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP4CH2</name>
              <description>Select channel ADCx_IN02 in Group_pri4</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP4CH1</name>
              <description>Select channel ADCx_IN01 in Group_pri4</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP4CH0</name>
              <description>Select channel ADCx_IN00 in Group_pri4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3CH6</name>
              <description>Select channel ADCx_IN06 in Group_pri3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3CH5</name>
              <description>Select channel ADCx_IN05 in Group_pri3</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3CH4</name>
              <description>Select channel ADCx_IN04 in Group_pri3</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3CH3</name>
              <description>Select channel ADCx_IN03 in Group_pri3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3CH2</name>
              <description>Select channel ADCx_IN02 in Group_pri3</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3CH1</name>
              <description>Select channel ADCx_IN01 in Group_pri3</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3CH0</name>
              <description>Select channel ADCx_IN00 in Group_pri3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAMPR0</name>
          <displayName>SAMPR0</displayName>
          <description>Sample time register 0</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x02020202</resetValue>
          <fields>
            <field>
              <name>SPT03</name>
              <description>Channel ADCx_IN03 sampling time</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPT02</name>
              <description>Channel ADCx_IN02 sampling time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPT01</name>
              <description>Channel ADCx_IN01 sampling time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPT00</name>
              <description>Channel ADCx_IN00 sampling time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAMPR1</name>
          <displayName>SAMPR1</displayName>
          <description>Sample time register 1</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x02020202</resetValue>
          <fields>
            <field>
              <name>SPT06</name>
              <description>Channel ADCx_IN06 sampling time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPT05</name>
              <description>Channel ADCx_IN05 sampling time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPT04</name>
              <description>Channel ADCx_IN04 sampling time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHPRI0</name>
          <displayName>CHPRI0</displayName>
          <description>Channel priority register 0</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x76543210</resetValue>
          <fields>
            <field>
              <name>PRI6</name>
              <description>The 6th priority of the selected channel</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI5</name>
              <description>The 5th priority of the selected channel</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI4</name>
              <description>The 4th priority of the selected channel</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI3</name>
              <description>The 3th priority of the selected channel</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI2</name>
              <description>The 2nd priority of the selected channel</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI1</name>
              <description>The 1st priority of the selected channel</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI0</name>
              <description>The zeroth priority of the selected channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDT0</name>
          <displayName>ADDT0</displayName>
          <description>ADC channel addition times register 0</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH6ADDT</name>
              <description>The total addition conversion times of ADCx_IN06</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5ADDT</name>
              <description>The total addition conversion times of ADCx_IN05</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4ADDT</name>
              <description>The total addition conversion times of ADCx_IN04</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3ADDT</name>
              <description>The total addition conversion times of ADCx_IN03</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2ADDT</name>
              <description>The total addition conversion times of ADCx_IN02</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1ADDT</name>
              <description>The total addition conversion times of ADCx_IN01</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0ADDT</name>
              <description>The total addition conversion times of ADCx_IN00</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDDATA</name>
          <displayName>SDDATA</displayName>
          <description>Self-diagnosis data register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SDDATA</name>
              <description>The self-diagnosis data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP1BIDATA</name>
          <displayName>GP1BIDATA</displayName>
          <description>Group_prix bifurcate data register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA</name>
              <description>The data by the second trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP1BIDATA1</name>
          <displayName>GP1BIDATA1</displayName>
          <description>Group_prix bifurcate data register 1</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA</name>
              <description>The data by the second trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP1BIDATA2</name>
          <displayName>GP1BIDATA2</displayName>
          <description>Group_prix bifurcate data register 2</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA1</name>
              <description>The data by the first trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP2BIDATA</name>
          <displayName>GP2BIDATA</displayName>
          <description>Group_prix bifurcate data register</description>
          <addressOffset>0x6c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA</name>
              <description>The data by the second trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP2BIDATA1</name>
          <displayName>GP2BIDATA1</displayName>
          <description>Group_prix bifurcate data register 1</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA1</name>
              <description>The data by the first trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP2BIDATA2</name>
          <displayName>GP2BIDATA2</displayName>
          <description>Group_prix bifurcate data register 2</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA1</name>
              <description>The data by the first trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP3BIDATA</name>
          <displayName>GP3BIDATA</displayName>
          <description>Group_prix bifurcate data register</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA</name>
              <description>The data by the second trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP3BIDATA1</name>
          <displayName>GP3BIDATA1</displayName>
          <description>Group_prix bifurcate data register 1</description>
          <addressOffset>0x7c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA1</name>
              <description>The data by the first trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP3BIDATA2</name>
          <displayName>GP3BIDATA2</displayName>
          <description>Group_prix bifurcate data register 2</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA2</name>
              <description>The data by the second trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP4BIDATA</name>
          <displayName>GP4BIDATA</displayName>
          <description>Group_prix bifurcate data register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA</name>
              <description>The data by the second trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP4BIDATA1</name>
          <displayName>GP4BIDATA1</displayName>
          <description>Group_prix bifurcate data register 1</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA1</name>
              <description>The data by the first trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
