burakenez/gd32m53x-cmake-vscode/Examples/EVIC/cmp_trigger_group_intput_capture/GD32M53x.svd
        <register>
          <name>GP4BIDATA2</name>
          <displayName>GP4BIDATA2</displayName>
          <description>Group_prix bifurcate data register 2</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA2</name>
              <description>The data by the second trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP1DMAR</name>
          <displayName>GP1DMAR</displayName>
          <description>Group_prix data DMA register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA2</name>
              <description>The data by the second trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP2DMAR</name>
          <displayName>GP2DMAR</displayName>
          <description>Group_prix data DMA register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA2</name>
              <description>The data by the second trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP3DMAR</name>
          <displayName>GP3DMAR</displayName>
          <description>Group_prix data DMA register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA2</name>
              <description>The data by the second trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP4DMAR</name>
          <displayName>GP4DMAR</displayName>
          <description>Group_prix data DMA register</description>
          <addressOffset>0x9c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>The data of Group_prix which can be accessed by DMA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH0DATA</name>
          <displayName>CH0DATA</displayName>
          <description>Channel 0 data register</description>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHxDATA</name>
              <description>Channel 15 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH1DATA</name>
          <displayName>CH1DATA</displayName>
          <description>Channel 1 data register</description>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHxDATA</name>
              <description>Channel 15 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2DATA</name>
          <displayName>CH2DATA</displayName>
          <description>Channel 2 data register</description>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHxDATA</name>
              <description>Channel 15 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3DATA</name>
          <displayName>CH3DATA</displayName>
          <description>Channel 3 data register</description>
          <addressOffset>0xac</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHxDATA</name>
              <description>Channel 15 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4DATA</name>
          <displayName>CH4DATA</displayName>
          <description>Channel 4 data register</description>
          <addressOffset>0xb0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHxDATA</name>
              <description>Channel 15 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH5DATA</name>
          <displayName>CH5DATA</displayName>
          <description>Channel 5 data register</description>
          <addressOffset>0xb4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHxDATA</name>
              <description>Channel 15 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH6DATA</name>
          <displayName>CH6DATA</displayName>
          <description>Channel 6 data register</description>
          <addressOffset>0xb8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHxDATA</name>
              <description>Channel 15 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDCTL</name>
          <displayName>WDCTL</displayName>
          <description>Watchdog control register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WDBCHSEL</name>
              <description>Analog watchdog B channel select</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDABMF</name>
              <description>Analog watchdog A/B complex compare monitor flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WDBMF</name>
              <description>Analog watchdog B compare monitor flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WDAMF</name>
              <description>Analog watchdog A compare monitor flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WDBE</name>
              <description>Analog watchdog B event flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDAE</name>
              <description>Analog watchdog A event flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDABCC</name>
              <description>Watchdog A/B complex conditions configuration</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WINEN</name>
              <description>Window mode enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDBCM</name>
              <description>Watchdog B compare mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDBIE</name>
              <description>Interrupt enable for watchdog B</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDBEN</name>
              <description>Watchdog B enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDAIE</name>
              <description>Interrupt enable for watchdog A</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDAEN</name>
              <description>Watchdog A enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDATHOLD</name>
          <displayName>WDATHOLD</displayName>
          <description>Watchdog A threshold register</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFF0000</resetValue>
          <fields>
            <field>
              <name>WDAHT</name>
              <description>High threshold for analog watchdog A</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDALT</name>
              <description>Low threshold for analog watchdog A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDBTHOLD</name>
          <displayName>WDBTHOLD</displayName>
          <description>Watchdog B threshold register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFF0000</resetValue>
          <fields>
            <field>
              <name>WDBHT</name>
              <description>High threshold for analog watchdog B</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDBLT</name>
              <description>Low threshold for analog watchdog B</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDACH</name>
          <displayName>WDACH</displayName>
          <description>Watchdog A channel config register</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WDACH6</name>
              <description>Select ADCx_IN6 for watchdog A</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDACH5</name>
              <description>Select ADCx_IN5 for watchdog A</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDACH4</name>
              <description>Select ADCx_IN4 for watchdog A</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDACH3</name>
              <description>Select ADCx_IN3 for watchdog A</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDACH2</name>
              <description>Select ADCx_IN2 for watchdog A</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDACH1</name>
              <description>Select ADCx_IN1 for watchdog A</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDACH0</name>
              <description>Select ADCx_IN0 for watchdog A</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDACH6M</name>
              <description>Channel ADCx_IN06 watchdog A compare mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDACH5M</name>
              <description>Channel ADCx_IN05 watchdog A compare mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDACH4M</name>
              <description>Channel ADCx_IN04 watchdog A compare mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDACH3M</name>
              <description>Channel ADCx_IN03 watchdog A compare mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDACH2M</name>
              <description>Channel ADCx_IN02 watchdog A compare mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDACH1M</name>
              <description>Channel ADCx_IN01 watchdog A compare mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDACH0M</name>
              <description>Channel ADCx_IN00 watchdog A compare mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDGA_CHAN_STR</name>
          <displayName>WDGA_CHAN_STR</displayName>
          <description>Window A compare channel status register, ADC_WDGA_CHAN_STR</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VINTCMPF</name>
              <description>Internal reference voltage channel Window A compare status</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEMPCMPF</name>
              <description>Temperature sensor channel Window A compare status</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH9CMPF</name>
              <description>Channel ADCx_IN09 Window A compare status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH8CMPF</name>
              <description>Channel ADCX_IN08 Window A compare status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH7CMPF</name>
              <description>Channel ADCx_IN07 Window A compare status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6CMPF</name>
              <description>Channel ADCx_IN06 Window A compare status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5CMPF</name>
              <description>Channel ADCx_IN05 Window A compare status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4CMPF</name>
              <description>Channel ADCx_IN04 Window A compare status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3CMPF</name>
              <description>Channel ADCx_IN03 Window A compare status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2CMPF</name>
              <description>Channel ADCx_IN02 Window A compare status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1CMPF</name>
              <description>Channel ADCx_IN01 Window A compare status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0CMPF</name>
              <description>Channel ADCx_IN00 Window A compare status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL1</name>
          <displayName>CTL1</displayName>
          <description>Control register 1</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DRES</name>
              <description>ADC resolution</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCON</name>
              <description>ADC ON</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
