burakenez/gd32m53x-cmake-vscode/Examples/EVIC/cmp_trigger_group_intput_capture/GD32M53x.svd
        <register>
          <name>SHCTL</name>
          <displayName>SHCTL</displayName>
          <description>Sample-and-hold control register</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <resetValue>0x0C800000</resetValue>
          <fields>
            <field>
              <name>SHSTIME</name>
              <description>The sample time of sample-and-hold circuit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHHTIME</name>
              <description>The hold time of sample-and-hold circuit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHSTAR</name>
              <description>Software start flag of sample-and-hold circuit in Constant sampling mod</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHEND</name>
              <description>Software end flag of sample-and-hold circuit in Constant sampling mod</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHMD</name>
              <description>Channel-Dedicated Sample-and-Hold Circuit Operating Mode Setting</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SH02EN</name>
              <description>Enable channel ADCx_IN02 sample-and-hold circuit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SH01EN</name>
              <description>Enable channel ADCx_IN01 sample-and-hold circuit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SH00EN</name>
              <description>Enable channel ADCx_IN00 sample-and-hold circuit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTL</name>
          <displayName>DMACTL</displayName>
          <description>DMA control register</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GP4DMAEN</name>
              <description>DMA request enable of Group_pri4</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP4DDS</name>
              <description>DMA disable mode of Group_pri4</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP4OVRF</name>
              <description>DMA overrun flag of Group_pri4</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP4OVREN</name>
              <description>DMA overrun detect enable of Group_pri4</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP4OVRIE</name>
              <description>DMA overrun detect interrupt enable of Group_pri4</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3DMAEN</name>
              <description>DMA request enable of Group_pri3</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3DDS</name>
              <description>DMA disable mode of Group_pri3</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3OVRF</name>
              <description>DMA overrun flag of Group_pri3</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3OVREN</name>
              <description>DMA overrun detect enable of Group_pri3</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3OVRIE</name>
              <description>DMA overrun detect interrupt enable of Group_pri3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP2DMAEN</name>
              <description>DMA request enable of Group_pri2</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP2DDS</name>
              <description>DMA disable mode of Group_pri2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP2OVRF</name>
              <description>DMA overrun flag of Group_pri2</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP2OVREN</name>
              <description>DMA overrun detect enable of Group_pri2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP2OVRIE</name>
              <description>DMA overrun detect interrupt enable of Group_pri2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP1DMAEN</name>
              <description>DMA request enable of Group_pri1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP1DDS</name>
              <description>DMA disable mode of Group_pri1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP1OVRF</name>
              <description>DMA overrun flag of Group_pri1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP1OVREN</name>
              <description>DMA overrun detect enable of Group_pri1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP1OVRIE</name>
              <description>DMA overrun detect interrupt enable of Group_pri1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BITRGCTL</name>
          <displayName>BITRGCTL</displayName>
          <description>Bifurcate trigger control register</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GP4BICHSEL</name>
              <description>Bifurcate Trigger Channel Select of Group_pri4</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP4BIMEN</name>
              <description>Bifurcate Trigger Mode enable of Group_pri4</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP4BLRSCN</name>
              <description>For any group use double trigger function, the next trigger during the current A/D conversion round restore enable:</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3BICHSEL</name>
              <description>Bifurcate Trigger Channel Select of Group_pri4</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3BIMEN</name>
              <description>Bifurcate Trigger Mode enable of Group_pri4</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3BITGRS</name>
              <description>Enable the next trigger restore of Group_pri3</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP2BICHSEL</name>
              <description>Bifurcate Trigger Channel Select of Group_pri4</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP2BIMEN</name>
              <description>Bifurcate Trigger Mode enable of Group_pri4</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP2BLRSCN</name>
              <description>For any group use double trigger function, the next trigger during the current A/D conversion round restore enable:</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dblans_pri1</name>
              <description>Bifurcate Trigger Channel Select of Group_pri1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dble_pri1</name>
              <description>Bifurcate Trigger Mode enable of Group_pri1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dblrscn_pri1</name>
              <description>For any group use double trigger function, the next trigger during the current A/D conversion round restore enable:</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
