burakenez/gd32m53x-cmake-vscode/Examples/EVIC/cmp_trigger_group_intput_capture/GD32M53x.svd
        <register>
          <name>CHSEL0</name>
          <displayName>CHSEL0</displayName>
          <description>Channel selection register 0</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GP2CHVREF</name>
              <description>Select Internal Reference Voltage A/D Conversion in Group_pri2</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP2CHTEMP</name>
              <description>Select Temperature Sensor A/D Conversion in Group_pri2</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP2CH9</name>
              <description>Select channel ADCx_IN09 in Group_pri2</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP2CH8</name>
              <description>Select channel ADCx_IN08 in Group_pri2</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP2CH7</name>
              <description>Select channel ADCx_IN07 in Group_pri2</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP2CH6</name>
              <description>Select channel ADCx_IN06 in Group_pri2</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP2CH5</name>
              <description>Select channel ADCx_IN05 in Group_pri2</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP2CH4</name>
              <description>Select channel ADCx_IN04 in Group_pri2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP2CH3</name>
              <description>Select channel ADCx_IN03 in Group_pri2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP2CH2</name>
              <description>Select channel ADCx_IN02 in Group_pri2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP2CH1</name>
              <description>Select channel ADCx_IN01 in Group_pri2</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP2CH0</name>
              <description>Select channel ADCx_IN00 in Group_pri2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP1CHVREF</name>
              <description>Select Internal Reference Voltage A/D Conversion in Group_pri1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP1CHTEMP</name>
              <description>Select Temperature Sensor A/D Conversion in Group_pri1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP1CH9</name>
              <description>Select channel ADCx_IN09 in Group_pri1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP1CH8</name>
              <description>Select channel ADCx_IN08 in Group_pri1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP1CH7</name>
              <description>Select channel ADCx_IN07 in Group_pri1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP1CH6</name>
              <description>Select channel ADCx_IN06 in Group_pri1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP1CH5</name>
              <description>Select channel ADCx_IN05 in Group_pri1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP1CH4</name>
              <description>Select channel ADCx_IN04 in Group_pri1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP1CH3</name>
              <description>Select channel ADCx_IN03 in Group_pri1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP1CH2</name>
              <description>Select channel ADCx_IN02 in Group_pri1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP1CH1</name>
              <description>Select channel ADCx_IN01 in Group_pri1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP1CH0</name>
              <description>Select channel ADCx_IN00 in Group_pri1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHSEL1</name>
          <displayName>CHSEL1</displayName>
          <description>Channel selection register 1</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GP4CHVINT</name>
              <description>Select Internal Reference Voltage A/D Conversion in Group_pri4</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP4CHTEMP</name>
              <description>Select Temperature Sensor A/D Conversion in Group_pri4</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP4CH9</name>
              <description>Select channel ADCx_IN09 in Group_pri4</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP4CH8</name>
              <description>Select channel ADCx_IN08 in Group_pri4</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP4CH7</name>
              <description>Select channel ADCx_IN07 in Group_pri4</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP4CH6</name>
              <description>Select channel ADCx_IN06 in Group_pri4</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP4CH5</name>
              <description>Select channel ADCx_IN05 in Group_pri4</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP4CH4</name>
              <description>Select channel ADCx_IN04 in Group_pri4</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP4CH3</name>
              <description>Select channel ADCx_IN03 in Group_pri4</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP4CH2</name>
              <description>Select channel ADCx_IN02 in Group_pri4</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP4CH1</name>
              <description>Select channel ADCx_IN01 in Group_pri4</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP4CH0</name>
              <description>Select channel ADCx_IN00 in Group_pri4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3CHVINT</name>
              <description>Select Internal Reference Voltage A/D Conversion in Group_pri3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3CHTEMP</name>
              <description>Select Temperature Sensor A/D Conversion in Group_pri3</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3CH9</name>
              <description>Select channel ADCx_IN09 in Group_pri3</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3CH8</name>
              <description>Select channel ADCx_IN08 in Group_pri3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3CH7</name>
              <description>Select channel ADCx_IN07 in Group_pri3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3CH6</name>
              <description>Select channel ADCx_IN06 in Group_pri3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3CH5</name>
              <description>Select channel ADCx_IN05 in Group_pri3</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3CH4</name>
              <description>Select channel ADCx_IN04 in Group_pri3</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3CH3</name>
              <description>Select channel ADCx_IN03 in Group_pri3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3CH2</name>
              <description>Select channel ADCx_IN02 in Group_pri3</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3CH1</name>
              <description>Select channel ADCx_IN01 in Group_pri3</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP3CH0</name>
              <description>Select channel ADCx_IN00 in Group_pri3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="ADC0.SAMPR0"></register>
        <register>
          <name>SAMPR1</name>
          <displayName>SAMPR1</displayName>
          <description>Sample time register 1</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SPT07</name>
              <description>Channel ADCx_IN07 sampling time</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPT06</name>
              <description>Channel ADCx_IN06 sampling time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPT05</name>
              <description>Channel ADCx_IN05 sampling time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPT04</name>
              <description>Channel ADCx_IN04 sampling time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
                <register>
          <name>SAMPR2</name>
          <displayName>SAMPR2</displayName>
          <description>Sample time register 2</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x02020202</resetValue>
          <fields>
            <field>
              <name>SPT11</name>
              <description>Internal voltage channel sampling time</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPT10</name>
              <description>Temperature sensor channel sampling time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPT09</name>
              <description>Channel ADCx_IN09 sampling time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPT08</name>
              <description>Channel ADCx_IN08 sampling time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHPRI0</name>
          <displayName>CHPRI0</displayName>
          <description>Channel priority register 0</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x76543210</resetValue>
          <fields>
            <field>
              <name>PRI7</name>
              <description>The 7th priority of the selected channel</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI6</name>
              <description>The 6th priority of the selected channel</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI5</name>
              <description>The 5th priority of the selected channel</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI4</name>
              <description>The 4th priority of the selected channel</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI3</name>
              <description>The 3th priority of the selected channel</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI2</name>
              <description>The 2nd priority of the selected channel</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI1</name>
              <description>The 1st priority of the selected channel</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI0</name>
              <description>The zeroth priority of the selected channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
                <register>
          <name>CHPRI1</name>
          <displayName>CHPRI1</displayName>
          <description>Channel priority register 1</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x0EDCBA98</resetValue>
          <fields>
            <field>
              <name>PRI11</name>
              <description>The 11th priority of the selected channel</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI10</name>
              <description>The 10th priority of the selected channel</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI9</name>
              <description>The 9th priority of the selected channel</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI8</name>
              <description>The 8th priority of the selected channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
