burakenez/gd32m53x-cmake-vscode/Examples/EVIC/cmp_trigger_group_intput_capture/GD32M53x.svd
        <register>
          <name>ADDT0</name>
          <displayName>ADDT0</displayName>
          <description>ADC channel addition times register 0</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH7ADDT</name>
              <description>The total addition conversion times of ADCx_IN07</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6ADDT</name>
              <description>The total addition conversion times of ADCx_IN06</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5ADDT</name>
              <description>The total addition conversion times of ADCx_IN05</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4ADDT</name>
              <description>The total addition conversion times of ADCx_IN04</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3ADDT</name>
              <description>The total addition conversion times of ADCx_IN03</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2ADDT</name>
              <description>The total addition conversion times of ADCx_IN02</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1ADDT</name>
              <description>The total addition conversion times of ADCx_IN01</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0ADDT</name>
              <description>The total addition conversion times of ADCx_IN00</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDT1</name>
          <displayName>ADDT1</displayName>
          <description>ADC channel addition times register 1</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VADDT</name>
              <description>The total addition conversion times of internal reference voltage channel</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEMPADDT</name>
              <description>The total addition conversion times of temperature sensor channel</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH9ADDT</name>
              <description>The total addition conversion times of ADCx_IN09</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH8ADDT</name>
              <description>The total addition conversion times of ADCx_IN08</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDDATA</name>
          <displayName>SDDATA</displayName>
          <description>Self-diagnosis data register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SDDATA</name>
              <description>The self-diagnosis data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP1BIDATA</name>
          <displayName>GP1BIDATA</displayName>
          <description>Group_prix bifurcate data register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA</name>
              <description>The data by the second trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP1BIDATA1</name>
          <displayName>GP1BIDATA1</displayName>
          <description>Group_prix bifurcate data register 1</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA</name>
              <description>The data by the second trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP1BIDATA2</name>
          <displayName>GP1BIDATA2</displayName>
          <description>Group_prix bifurcate data register 2</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA1</name>
              <description>The data by the first trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP2BIDATA</name>
          <displayName>GP2BIDATA</displayName>
          <description>Group_prix bifurcate data register</description>
          <addressOffset>0x6c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA</name>
              <description>The data by the second trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP2BIDATA1</name>
          <displayName>GP2BIDATA1</displayName>
          <description>Group_prix bifurcate data register 1</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA1</name>
              <description>The data by the first trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP2BIDATA2</name>
          <displayName>GP2BIDATA2</displayName>
          <description>Group_prix bifurcate data register 2</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA1</name>
              <description>The data by the first trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP3BIDATA</name>
          <displayName>GP3BIDATA</displayName>
          <description>Group_prix bifurcate data register</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA</name>
              <description>The data by the second trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP3BIDATA1</name>
          <displayName>GP3BIDATA1</displayName>
          <description>Group_prix bifurcate data register 1</description>
          <addressOffset>0x7c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA1</name>
              <description>The data by the first trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP3BIDATA2</name>
          <displayName>GP3BIDATA2</displayName>
          <description>Group_prix bifurcate data register 2</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA2</name>
              <description>The data by the second trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP4BIDATA</name>
          <displayName>GP4BIDATA</displayName>
          <description>Group_prix bifurcate data register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA</name>
              <description>The data by the second trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP4BIDATA1</name>
          <displayName>GP4BIDATA1</displayName>
          <description>Group_prix bifurcate data register 1</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA1</name>
              <description>The data by the first trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP4BIDATA2</name>
          <displayName>GP4BIDATA2</displayName>
          <description>Group_prix bifurcate data register 2</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA2</name>
              <description>The data by the second trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP1DMAR</name>
          <displayName>GP1DMAR</displayName>
          <description>Group_prix data DMA register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA2</name>
              <description>The data by the second trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP2DMAR</name>
          <displayName>GP2DMAR</displayName>
          <description>Group_prix data DMA register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA2</name>
              <description>The data by the second trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP3DMAR</name>
          <displayName>GP3DMAR</displayName>
          <description>Group_prix data DMA register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIDATA2</name>
              <description>The data by the second trigger in bifurcate trigger mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GP4DMAR</name>
          <displayName>GP4DMAR</displayName>
          <description>Group_prix data DMA register</description>
          <addressOffset>0x9c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>The data of Group_prix which can be accessed by DMA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CH0DATA</name>
          <displayName>CH0DATA</displayName>
          <description>Channel 0 data register</description>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHxDATA</name>
              <description>Channel 15 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH1DATA</name>
          <displayName>CH1DATA</displayName>
          <description>Channel 1 data register</description>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHxDATA</name>
              <description>Channel 15 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2DATA</name>
          <displayName>CH2DATA</displayName>
          <description>Channel 2 data register</description>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHxDATA</name>
              <description>Channel 15 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3DATA</name>
          <displayName>CH3DATA</displayName>
          <description>Channel 3 data register</description>
          <addressOffset>0xac</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHxDATA</name>
              <description>Channel 15 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4DATA</name>
          <displayName>CH4DATA</displayName>
          <description>Channel 4 data register</description>
          <addressOffset>0xb0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHxDATA</name>
              <description>Channel 15 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH5DATA</name>
          <displayName>CH5DATA</displayName>
          <description>Channel 5 data register</description>
          <addressOffset>0xb4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHxDATA</name>
              <description>Channel 15 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH6DATA</name>
          <displayName>CH6DATA</displayName>
          <description>Channel 6 data register</description>
          <addressOffset>0xb8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHxDATA</name>
              <description>Channel 15 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH7DATA</name>
          <displayName>CH7DATA</displayName>
          <description>Channel 7 data register</description>
          <addressOffset>0xbc</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHxDATA</name>
              <description>Channel 15 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH8DATA</name>
          <displayName>CH8DATA</displayName>
          <description>Channel 8 data register</description>
          <addressOffset>0xc0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHxDATA</name>
              <description>Channel 15 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH9DATA</name>
          <displayName>CH9DATA</displayName>
          <description>Channel 9 data register</description>
          <addressOffset>0xc4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHxDATA</name>
              <description>Channel 15 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMPDATA</name>
          <displayName>TEMPDATA</displayName>
          <description>Temperature sensor data register</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEMPDATA</name>
              <description>Temperature sensor data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VINTDATA</name>
          <displayName>VINTDATA</displayName>
          <description>Internal reference voltage data register</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VINTDATA</name>
              <description>Internal reference voltage channel data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        
