burakenez/gd32m53x-cmake-vscode/Examples/EVIC/cmp_trigger_group_intput_capture/GD32M53x.svd
      </registers>
    </peripheral>
<peripheral>
    <name>EVIC</name>
    <description>Event interconnection unit</description>
    <groupName>EVIC</groupName>
    <baseAddress>0x40018400</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
    <interrupt>
        <name>EVIC</name>
        <value>78</value>
      </interrupt>
    <registers>
      <register>
        <name>SWEV</name>
        <displayName>SWEV</displayName>
        <description>Software event register</description>
        <addressOffset>0x00</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>RWEN</name>
              <description>EVIC_SWEV register write enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWEVG</name>
              <description>Software event generation</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BWEN</name>
              <description>SWEVG bit write enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SGIO0</name>
        <displayName>SGIO0</displayName>
        <description>Event interconnect for single I/O register 0</description>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_SGIOx register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0</name>
              <description>Event source selection for single I/O</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SGIO1</name>
        <displayName>SGIO1</displayName>
        <description>Event interconnect for single I/O register 1</description>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_SGIOx register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0</name>
              <description>Event source selection for single I/O</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SGIO2</name>
        <displayName>SGIO2</displayName>
        <description>Event interconnect for single I/O register 2</description>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_SGIOx register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0</name>
              <description>Event source selection for single I/O</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SGIO3</name>
        <displayName>SGIO3</displayName>
        <description>Event interconnect for single I/O register 3</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_SGIOx register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0</name>
              <description>Event source selection for single I/O</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>INGRPE</name>
        <displayName>INGRPE</displayName>
        <description>Event interconnect for input group E register</description>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_INGRPE register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0</name>
              <description>Event source selection for group E I/O input</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>INGRPF</name>
        <displayName>INGRPF</displayName>
        <description>Event interconnect for input group F register</description>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_INGRPF register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0</name>
              <description>Event source selection for group F I/O input</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>OUTGRPE</name>
        <displayName>OUTGRPE</displayName>
        <description>Event interconnect for output group E register</description>
        <addressOffset>0x1C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_OUTGRPE register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0</name>
              <description>Event source selection for group E I/O output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>OUTGRPF</name>
        <displayName>OUTGRPF</displayName>
        <description>Event interconnect for output group F register</description>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_OUTGRPF register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0</name>
              <description>Event source selection for group F I/O output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DAC0COV</name>
        <displayName>DAC0COV</displayName>
        <description>Event interconnect for DAC0 conversion register</description>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_DAC0COV register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL1</name>
              <description>Event source selection for DAC0_OUT1 conversion</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0</name>
              <description>Event source selection for DAC0_OUT0 conversion</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ADC0COV</name>
        <displayName>ADC0COV</displayName>
        <description>Event interconnect for ADC0 conversion register</description>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_ADC0COV register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL1</name>
              <description>Event source selection 1 for ADC0 group conversion</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0</name>
              <description>Event source selection 0 for ADC0 group conversion</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ADC2COV</name>
        <displayName>ADC2COV</displayName>
        <description>Event interconnect for ADC2 conversion register</description>
        <addressOffset>0x2C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_ADC2COV register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL1</name>
              <description>Event source selection 1 for ADC2 group conversion</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0</name>
              <description>Event source selection 0 for ADC2 group conversion</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>RCU</name>
        <displayName>RCU</displayName>
        <description>Event interconnect for RCU register</description>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_RCU register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0</name>
              <description>Event source selection for IRC32M switching</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER0</name>
        <displayName>TIMER0</displayName>
        <description>Event interconnect for TIMER0 register</description>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_TIMER0 register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0</name>
              <description>Event source selection for TIMER0 slave mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER7</name>
        <displayName>TIMER7</displayName>
        <description>Event interconnect for TIMER7 register</description>
        <addressOffset>0x3C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_TIMER7 register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0</name>
              <description>Event source selection for TIMER7 slave mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CPTIMER0</name>
        <displayName>CPTIMER0</displayName>
        <description>Event interconnect for CPTIMER0 register</description>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_CPTIMER0 register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0</name>
              <description>Event source selection for CPTIMER0 slave mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CPTIMERW</name>
        <displayName>CPTIMERW</displayName>
        <description>Event interconnect for CPTIMERW register</description>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_CPTIMERW register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0</name>
              <description>Event source selection for CPTIMERW slave mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER1</name>
        <displayName>TIMER1</displayName>
        <description>Event interconnect for TIMER1 register</description>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_TIMER1 register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0</name>
              <description>Event input source selection for TIMER1 slave mode trigger</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER2</name>
        <displayName>TIMER2</displayName>
        <description>Event interconnect for TIMER2 register</description>
        <addressOffset>0x4C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_TIMER2 register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0</name>
              <description>Event source selection for TIMER2 slave mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>GPTIMER_0</name>
        <displayName>GPTIMER_0</displayName>
        <description>Event interconnect for GPTIMER register 0</description>
        <addressOffset>0x50</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_GPTIMER_0 register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL1</name>
              <description>Event source selection 1 for GPTIMER slave mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0</name>
              <description>Event source selection 0 for GPTIMER slave mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>GPTIMER_1</name>
        <displayName>GPTIMER_1</displayName>
        <description>Event interconnect for GPTIMER register 1</description>
        <addressOffset>0x54</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_GPTIMER_1 register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL3</name>
              <description>Event source selection 3 for GPTIMER slave mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL2</name>
              <description>Event source selection 2 for GPTIMER slave mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>GPTIMER_2</name>
        <displayName>GPTIMER_2</displayName>
        <description>Event interconnect for GPTIMER register 2</description>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_GPTIMER_2 register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL5</name>
              <description>Event source selection 5 for GPTIMER slave mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL4</name>
              <description>Event source selection 4 for GPTIMER slave mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>GPTIMER_3</name>
        <displayName>GPTIMER_3</displayName>
        <description>Event interconnect for GPTIMER register 3</description>
        <addressOffset>0x5C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_GPTIMER_3 register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL7</name>
              <description>Event source selection 7 for GPTIMER slave mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL6</name>
              <description>Event source selection 6 for GPTIMER slave mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
