burakenez/gd32m53x-cmake-vscode/Examples/EVIC/cmp_trigger_group_intput_capture/GD32M53x.svd
      <register>
        <name>DAC0EN</name>
        <displayName>DAC0EN</displayName>
        <description>Event interconnect for DAC0 enable register</description>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_DAC0EN register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL1</name>
              <description>Event source selection for enabling DAC0_OUT1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0</name>
              <description>Event source selection for enabling DAC0_OUT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DMAMUX_0</name>
        <displayName>DMAMUX_0</displayName>
        <description>Event interconnect for DMAMUX register 0</description>
        <addressOffset>0x64</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_DMAMUX_0 register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL1</name>
              <description>Event source selection 1 for DMAMUX</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0</name>
              <description>Event source selection 0 for DMAMUX</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DMAMUX_1</name>
        <displayName>DMAMUX_1</displayName>
        <description>Event interconnect for DMAMUX register 1</description>
        <addressOffset>0x68</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_DMAMUX_1 register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL3</name>
              <description>Event source selection 3 for DMAMUX</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL2</name>
              <description>Event source selection 2 for DMAMUX</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DMAMUX_2</name>
        <displayName>DMAMUX_2</displayName>
        <description>Event interconnect for DMAMUX register 2</description>
        <addressOffset>0x6C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_DMAMUX_2 register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL5</name>
              <description>Event source selection 5 for DMAMUX</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL4</name>
              <description>Event source selection 4 for DMAMUX</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DMAMUX_3</name>
        <displayName>DMAMUX_3</displayName>
        <description>Event interconnect for DMAMUX register 3</description>
        <addressOffset>0x70</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_DMAMUX_3 register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL7</name>
              <description>Event source selection 7 for DMAMUX</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL6</name>
              <description>Event source selection 6 for DMAMUX</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DMAMUX_4</name>
        <displayName>DMAMUX_4</displayName>
        <description>Event interconnect for DMAMUX register 4</description>
        <addressOffset>0x74</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_DMAMUX_4 register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL9</name>
              <description>Event source selection 9 for DMAMUX</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL8</name>
              <description>Event source selection 8 for DMAMUX</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DMAMUX_5</name>
        <displayName>DMAMUX_5</displayName>
        <description>Event interconnect for DMAMUX register 5</description>
        <addressOffset>0x78</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>EVIC_DMAMUX_5 register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL11</name>
              <description>Event source selection 11 for DMAMUX</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL10</name>
              <description>Event source selection 10 for DMAMUX</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SMCFG0</name>
        <displayName>SMCFG0</displayName>
        <description>Slave mode configuration register 0</description>
        <addressOffset>0x7C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000003</resetValue>
        <fields>
            <field>
              <name>CPTIMER0_SMSEL</name>
              <description>CPTIMER0 slave mode selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SMCFG1</name>
        <displayName>SMCFG1</displayName>
        <description>Slave mode configuration register 1</description>
        <addressOffset>0x80</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000003</resetValue>
        <fields>
            <field>
              <name>CPTIMERW_SMSEL</name>
              <description>CPTIMERW slave mode selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SGIOCFG0</name>
        <displayName>SGIOCFG0</displayName>
        <description>Single I/O configuration register 0</description>
        <addressOffset>0x84</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>SGIOM</name>
              <description>Single I/O mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SGIOPIN</name>
              <description>Single I/O pin</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SGIOPORT</name>
              <description>Single I/O port</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SGIOCFG1</name>
        <displayName>SGIOCFG1</displayName>
        <description>Single I/O configuration register 1</description>
        <addressOffset>0x88</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>SGIOM</name>
              <description>Single I/O mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SGIOPIN</name>
              <description>Single I/O pin</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SGIOPORT</name>
              <description>Single I/O port</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SGIOCFG2</name>
        <displayName>SGIOCFG2</displayName>
        <description>Single I/O configuration register 2</description>
        <addressOffset>0x8c</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>SGIOM</name>
              <description>Single I/O mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SGIOPIN</name>
              <description>Single I/O pin</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SGIOPORT</name>
              <description>Single I/O port</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SGIOCFG3</name>
        <displayName>SGIOCFG3</displayName>
        <description>Single I/O configuration register 3</description>
        <addressOffset>0x90</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>SGIOM</name>
              <description>Single I/O mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SGIOPIN</name>
              <description>Single I/O pin</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SGIOPORT</name>
              <description>Single I/O port</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>GRPECFG</name>
        <displayName>GRPECFG</displayName>
        <description>Group E configuration register</description>
        <addressOffset>0x94</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>PE14SEL</name>
              <description>PE14 pin selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE13SEL</name>
              <description>PE13 pin selection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE12SEL</name>
              <description>PE12 pin selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE11SEL</name>
              <description>PE11 pin selection</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE10SEL</name>
              <description>PE10 pin selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE9SEL</name>
              <description>PE9 pin selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE8SEL</name>
              <description>PE8 pin selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVWEN</name>
              <description>EVIC_GRPEDH register overwrite enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRPEOSEL</name>
              <description>Group E output selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRPEIND</name>
              <description>Group E input detection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>GRPEDH</name>
        <displayName>GRPEDH</displayName>
        <description>Group E data holding register</description>
        <addressOffset>0x98</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>GRPE_DH</name>
              <description>Group E holding data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>GPRFCFG</name>
        <displayName>GPRFCFG</displayName>
        <description>Group F configuration register</description>
        <addressOffset>0x9C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>PF14SEL</name>
              <description>PF14 pin selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PF13SEL</name>
              <description>PF13 pin selection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PF12SEL</name>
              <description>PF12 pin selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PF11SEL</name>
              <description>PE11 pin selection</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PF10SEL</name>
              <description>PF10 pin selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PF9SEL</name>
              <description>PF9 pin selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PF8SEL</name>
              <description>PF8 pin selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVWEN</name>
              <description>EVIC_GRPFDH register overwrite enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRPFOSEL</name>
              <description>Group F output selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRPFIND</name>
              <description>Group F input detection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>GRPFDH</name>
        <displayName>GRPFDH</displayName>
        <description>Group F data holding register</description>
        <addressOffset>0x100</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>GRPF_DH</name>
              <description>Group F holding data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
