burakenez/gd32m53x-cmake-vscode/Examples/EVIC/cmp_trigger_group_intput_capture/GD32M53x.svd
      </registers>
    </peripheral>

    <peripheral>
      <name>GPTIMER0</name>
      <description>General purpose timer</description>
      <groupName>GPTIMER</groupName>
    <baseAddress>0x40016000</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x100</size>
        <usage>registers</usage>
    </addressBlock>
    <interrupt>
        <name>GPTIMER0</name>
        <description>GPTIMER0 global interrupt</description>
        <value>30</value>
      </interrupt>
    <registers>
      <register>
        <name>WP</name>
        <displayName>WP</displayName>
        <description>Write-protect register</description>
        <addressOffset>0x00</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>WPKEY</name>
              <description>Write protection key</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SWRWPEN</name>
              <description>GPTIMERx_SWRST write protection enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWDWPEN</name>
              <description>GPTIMERx_SWDIS write protection enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWEWPEN</name>
              <description>GPTIMERx_SWEN write protection enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WPEN</name>
              <description>Register write protection enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SWEN</name>
        <displayName>SWEN</displayName>
        <description>Software enable register</description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>GPTIMER1SWEN</name>
              <description>GPTIMER1 counter software enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER0SWEN</name>
              <description>GPTIMER0 counter software enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SWDIS</name>
        <displayName>SWDIS</displayName>
        <description>Software disable register</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>GPTIMER1SWDIS</name>
              <description>GPTIMER1 counter software disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER0SWDIS</name>
              <description>GPTIMER0 counter software disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SWRST</name>
        <displayName>SWRST</displayName>
        <description>Software reset register</description>
        <addressOffset>0x0C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>GPTIMER1SWRST</name>
              <description>GPTIMER1 counter software reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER0SWRST</name>
              <description>GPTIMER0 counter software reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ESSEL</name>
        <displayName>ESSEL</displayName>
        <description>Counter enable source selection register</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>SWENCNT</name>
              <description>The software signal enable counter function enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL7ENCNT</name>
              <description>The EVSEL7 signal enable counter function enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL6ENCNT</name>
              <description>The EVSEL6 signal enable counter function enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL5ENCNT</name>
              <description>The EVSEL5 signal enable counter function enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL4ENCNT</name>
              <description>The EVSEL4 signal enable counter function enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL3ENCNT</name>
              <description>The EVSEL3 signal enable counter function enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL2ENCNT</name>
              <description>The EVSEL2 signal enable counter function enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL1ENCNT</name>
              <description>The EVSEL1 signal enable counter function enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0ENCNT</name>
              <description>The EVSEL0 signal enable counter function enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1ENCNT</name>
              <description>The channel 1 signal edge enable counter function enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0ENCNT</name>
              <description>The channel 0 signal edge enable counter function enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI3ENCNT</name>
              <description>The ETI3 signal edge enable counter function enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI2ENCNT</name>
              <description>The ETI2 signal edge enable counter function enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI1ENCNT</name>
              <description>The ETI1 signal edge enable counter function enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI0ENCNT</name>
              <description>The ETI0 signal edge enable counter function enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DSSEL</name>
        <displayName>DSSEL</displayName>
        <description>Counter disable source selection register</description>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>SWDISCNT</name>
              <description>The software signal disable counter function enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL7DISCNT</name>
              <description>The EVSEL7 signal disable counter function enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL6DISCNT</name>
              <description>The EVSEL6 signal disable counter function enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL5DISCNT</name>
              <description>The EVSEL5 signal disable counter function enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL4DISCNT</name>
              <description>The EVSEL4 signal disable counter function enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL3DISCNT</name>
              <description>The EVSEL3 signal disable counter function enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL2DISCNT</name>
              <description>The EVSEL2 signal disable counter function enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL1DISCNT</name>
              <description>The EVSEL1 signal disable counter function enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0DISCNT</name>
              <description>The EVSEL0 signal disable counter function enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1DISCNT</name>
              <description>The channel 1 signal edge disable counter function enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0DISCNT</name>
              <description>The channel 0 signal edge disable counter function enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI3DISCNT</name>
              <description>The ETI3 signal edge disable counter function enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI2DISCNT</name>
              <description>The ETI2 signal edge disable counter function enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI1DISCNT</name>
              <description>The ETI1 signal edge disable counter function enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI0DISCNT</name>
              <description>The ETI0 signal edge disable counter function enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>RSSEL</name>
        <displayName>RSSEL</displayName>
        <description>Counter reset source selection register</description>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>SWRSTCNT</name>
              <description>The software signal reset counter function enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSIRSTCNT</name>
              <description>The compares match, synchronous reset or input capture reset counter function enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL7RSTCNT</name>
              <description>The EVSEL7 signal reset counter function enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL6RSTCNT</name>
              <description>The EVSEL6 signal reset counter function enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL5RSTCNT</name>
              <description>The EVSEL5 signal reset counter function enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL4RSTCNT</name>
              <description>The EVSEL4 signal reset counter function enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL3RSTCNT</name>
              <description>The EVSEL3 signal reset counter function enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL2RSTCNT</name>
              <description>The EVSEL2 signal reset counter function enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL1RSTCNT</name>
              <description>The EVSEL1 signal reset counter function enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0RSTCNT</name>
              <description>The EVSEL0 signal reset counter function enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1RSTCNT</name>
              <description>The channel 1 signal edge reset counter function enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RSTCNT</name>
              <description>The channel 0 signal edge reset counter function enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI3RSTCNT</name>
              <description>The ETI3 signal edge reset counter function enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI2RSTCNT</name>
              <description>The ETI2 signal edge reset counter function enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI1RSTCNT</name>
              <description>The ETI1 signal edge reset counter function enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI0RSTCNT</name>
              <description>The ETI0 signal edge reset counter function enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
