burakenez/gd32m53x-cmake-vscode/Examples/EVIC/cmp_trigger_group_intput_capture/GD32M53x.svd
      <register>
        <name>CH0CSSEL</name>
        <displayName>CH0CSSEL</displayName>
        <description>Channel 0 capture source selection register</description>
        <addressOffset>0x1C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>EVSEL7CH0IC</name>
              <description>The EVSEL7 signal as the channel 0 input capture source enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL6CH0IC</name>
              <description>The EVSEL6 signal as the channel 0 input capture source enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL5CH0IC</name>
              <description>The EVSEL5 signal as the channel 0 input capture source enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL4CH0IC</name>
              <description>The EVSEL4 signal as the channel 0 input capture source enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL3CH0IC</name>
              <description>The EVSEL3 signal as the channel 0 input capture source enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL2CH0IC</name>
              <description>The EVSEL2 signal as the channel 0 input capture source enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL1CH0IC</name>
              <description>The EVSEL1 signal as the channel 0 input capture source enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0CH0IC</name>
              <description>The EVSEL0 signal as the channel 0 input capture source enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1CH0IC</name>
              <description>The channel 1 signal edge as the channel 0 input capture source enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0CH0IC</name>
              <description>The channel 0 signal edge as the channel 0 input capture source enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI3CH0IC</name>
              <description>The ETI3 signal edge as the channel 0 input capture source enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI2CH0IC</name>
              <description>The ETI2 signal edge as the channel 0 input capture source enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI1CH0IC</name>
              <description>The ETI1 signal edge as the channel 0 input capture source enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI0CH0IC</name>
              <description>The ETI0 signal edge as the channel 0 input capture source enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CH1CSSEL</name>
        <displayName>CH1CSSEL</displayName>
        <description>Channel 1 capture source selection register</description>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>EVSEL7CH1IC</name>
              <description>The EVSEL7 signal as the channel 1 input capture source enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL6CH1IC</name>
              <description>The EVSEL6 signal as the channel 1 input capture source enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL5CH1IC</name>
              <description>The EVSEL5 signal as the channel 1 input capture source enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL4CH1IC</name>
              <description>The EVSEL4 signal as the channel 1 input capture source enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL3CH1IC</name>
              <description>The EVSEL3 signal as the channel 1 input capture source enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL2CH1IC</name>
              <description>The EVSEL2 signal as the channel 1 input capture source enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL1CH1IC</name>
              <description>The EVSEL1 signal as the channel 1 input capture source enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0CH1IC</name>
              <description>The EVSEL0 signal as the channel 1 input capture source enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1CH1IC</name>
              <description>The channel 1 signal edge as the channel 1 input capture source enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0CH1IC</name>
              <description>The channel 0 signal edge as the channel 1 input capture source enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI3CH1IC</name>
              <description>The ETI3 signal edge as the channel 1 input capture source enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI2CH1IC</name>
              <description>The ETI2 signal edge as the channel 1 input capture source enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI1CH1IC</name>
              <description>The ETI1 signal edge as the channel 1 input capture source enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI0CH1IC</name>
              <description>The ETI0 signal edge as the channel 1 input capture source enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTL0</name>
        <displayName>CTL0</displayName>
        <description>Control register 0</description>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CKESEL</name>
              <description>Effective edge selection when ETIx(x = 0, 1, 2, 3) is selected as the clock.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CKSSEL</name>
              <description>Clock source selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCSOEN</name>
              <description>The counter cycle synchronization signal output enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CKDIV</name>
              <description>Clock division</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARSE</name>
              <description>Auto-reload shadow enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM</name>
              <description>Counter align mode selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FDIR</name>
              <description>Force the counting direction</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIR</name>
              <description>Direction</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPM</name>
              <description>Single pulse mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDIS</name>
              <description>Update event disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEN</name>
              <description>Counter enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CUPEVSSEL</name>
        <displayName>CUPEVSSEL</displayName>
        <description>Count up event source selection register</description>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>INTLCUPS</name>
              <description>The input level as the count up event source function enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL7CUPS</name>
              <description>The EVSEL7 signal as the count up event source function enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL6CUPS</name>
              <description>The EVSEL6 signal as the count up event source function enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL5CUPS</name>
              <description>The EVSEL5 signal as the count up event source function enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL4CUPS</name>
              <description>The EVSEL4 signal as the count up event source function enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL3CUPS</name>
              <description>The EVSEL3 signal as the count up event source function enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL2CUPS</name>
              <description>The EVSEL2 signal as the count up event source function enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL1CUPS</name>
              <description>The EVSEL1 signal as the count up event source function enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0CUPS</name>
              <description>The EVSEL0 signal as the count up event source function enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1CUPS</name>
              <description>The channel 1 signal edge as the count up event source function enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0CUPS</name>
              <description>The channel 0 signal edge as the count up event source function enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI3CUPS</name>
              <description>The ETI3 signal edge as the count up event source function enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI2CUPS</name>
              <description>The ETI2 signal edge as the count up event source function enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI1CUPS</name>
              <description>The ETI1 signal edge as the count up event source function enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI0CUPS</name>
              <description>The ETI0 signal edge as the count up event source function enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CDNEVSSEL</name>
        <displayName>CDNEVSSEL</displayName>
        <description>Count down event source selection register</description>
        <addressOffset>0x2C</addressOffset>
        <size>0x20</size>
        <resetValue>0x0000FFFF</resetValue>
        <fields>
            <field>
              <name>INTLCDWS</name>
              <description>The input level as the count down event source function enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL7CDWS</name>
              <description>The EVSEL7 signal as the count down event source function enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL6CDWS</name>
              <description>The EVSEL6 signal as the count down event source function enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL5CDWS</name>
              <description>The EVSEL5 signal as the count down event source function enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL4CDWS</name>
              <description>The EVSEL4 signal as the count down event source function enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL3CDWS</name>
              <description>The EVSEL3 signal as the count down event source function enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL2CDWS</name>
              <description>The EVSEL2 signal as the count down event source function enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL1CDWS</name>
              <description>The EVSEL1 signal as the count down event source function enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSEL0CDWS</name>
              <description>The EVSEL0 signal as the count down event source function enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1CDWS</name>
              <description>The channel 1 signal edge as the count down event source function enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0CDWS</name>
              <description>The channel 0 signal edge as the count down event source function enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI3CDWS</name>
              <description>The ETI3 signal edge as the count down event source function enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI2CDWS</name>
              <description>The ETI2 signal edge as the count down event source function enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI1CDWS</name>
              <description>The ETI1 signal edge as the count down event source function enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETI0CDWS</name>
              <description>The ETI0 signal edge as the count down event source function enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
