burakenez/gd32m53x-cmake-vscode/Examples/EVIC/cmp_trigger_group_intput_capture/GD32M53x.svd
      <register>
        <name>UPSSEL</name>
        <displayName>UPSSEL</displayName>
        <description>Update source selection register</description>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CH1UPSEL</name>
              <description>Channel 1 output mode update source selection.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0UPSEL</name>
              <description>Channel 0 output mode update source selection.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GLBUPSEL</name>
              <description>Global update mode update source selection.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARUPSEL</name>
              <description>The counter auto reload value update mode selection, used to set when the counter auto reload value will be automatically overloaded.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCCR2UPSEL</name>
              <description>The ADC triggered comparison value 2 update mode selection.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCCR1UPSEL</name>
              <description>The ADC triggered comparison value 1 update mode selection.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1COMV_ADDUPSEL</name>
              <description>Channel 1 additional comparison value update mode selection.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1CVUPSEL</name>
              <description>Channel 1 capture/compare value update mode selection.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0COMV_ADDUPSEL</name>
              <description>Channel 0 additional comparison value update mode selection.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0CVUPSEL</name>
              <description>Channel 0 capture/compare value update mode selection.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CNT</name>
        <displayName>CNT</displayName>
        <description>Counter register</description>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CNT</name>
              <description>This bit-field indicates the current counter value. Writing to this bit-field can change the value of the counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>PSC</name>
        <displayName>PSC</displayName>
        <description>Prescaler register</description>
        <addressOffset>0x4C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>PSC</name>
              <description>Prescaler value of the counter clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CAR</name>
        <displayName>CAR</displayName>
        <description>Counter auto reload register</description>
        <addressOffset>0x50</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CARL</name>
              <description>Counter auto reload value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CH0CV</name>
        <displayName>CH0CV</displayName>
        <description>Channel 0 capture/compare value register</description>
        <addressOffset>0x54</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CH0VAL</name>
              <description>Capture/compare value of channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CH1CV</name>
        <displayName>CH1CV</displayName>
        <description>Channel 1 capture/compare value register</description>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CH1VAL</name>
              <description>Capture/compare value of channel 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CH0COMV_ADD</name>
        <displayName>CH0COMV_ADD</displayName>
        <description>Channel 0 additional compare value register</description>
        <addressOffset>0x5C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CH0COMVAL_ADD</name>
              <description>Additional compare value of channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CH1COMV_ADD</name>
        <displayName>CH1COMV_ADD</displayName>
        <description>Channel 1 additional compare value register</description>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CH1COMVAL_ADD</name>
              <description>Additional compare value of channel 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DTCTL</name>
        <displayName>DTCTL</displayName>
        <description>Dead-time control register</description>
        <addressOffset>0x64</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DTASYEN</name>
              <description>Dead time asymmetric mode enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEDTSEN</name>
              <description>The falling edge dead time shadow register is enabled.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEDTCFG</name>
              <description>The falling edge dead time configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REDTSEN</name>
              <description>The rising edge dead time shadow register enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REDTCFG</name>
              <description>The rising edge dead time configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ADCTL</name>
        <displayName>ADCTL</displayName>
        <description>ADC trigger control register</description>
        <addressOffset>0x68</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>ADCSM4EN</name>
              <description>ADCSM4 pin output enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCSM4SEL</name>
              <description>Select the ADC trigger source connected to ADCSM4 pin</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCSM3EN</name>
              <description>ADCSM3 pin output enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCSM3SEL</name>
              <description>Select the ADC trigger source connected to ADCSM3 pin</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADT2DWGTEN</name>
              <description>The ADTCV2[15:0] comparison match (count down only) generate trigger enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADT2UPGTEN</name>
              <description>The ADTCV2[15:0] comparison match (count up only) generate trigger enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADT1DWGTEN</name>
              <description>The ADTCV1[15:0] comparison match (count down only) generate trigger enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADT1UPGTEN</name>
              <description>The ADTCV1[15:0] comparison match (count up only) generate trigger enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADTCV2SEN</name>
              <description>The ADTCV2[15:0] shadow register enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADTCV1SEN</name>
              <description>The ADTCV1[15:0] shadow register enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADTCV2SSEL</name>
              <description>The ADC conversion request skipping source selection and the trigger signal generated by ADTCV2[15:0]</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADTCV1SSEL</name>
              <description>The ADC conversion request skipping source selection and the trigger signal generated by ADTCV1[15:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ADCCR1</name>
        <displayName>ADCCR1</displayName>
        <description>ADC trigger compare value register 1</description>
        <addressOffset>0x6C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>ADTCV1</name>
              <description>The ADC trigger compare value 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ADCCR2</name>
        <displayName>ADCCR2</displayName>
        <description>ADC trigger compare value register 2</description>
        <addressOffset>0x70</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>ADTCV2</name>
              <description>The ADC trigger compare value 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ADCTRGS</name>
        <displayName>ADCTRGS</displayName>
        <description>ADC trigger skipping register</description>
        <addressOffset>0x74</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>ADCC2VAL</name>
              <description>This bit-field indicates the current ADC skipping counter 2 value.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCC2IVAL</name>
              <description>The ADC skipping counter 2 Initial value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCC2SVAL</name>
              <description>The ADC skipping counter 2 skipping value</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCC2SKSEL</name>
              <description>The ADC skipping counter 2 skipping source selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCC1VAL</name>
              <description>This bit-field indicates the current ADC skipping counter 1 value.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCC1IVAL</name>
              <description>The ADC skipping counter 1 Initial value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCC1SVAL</name>
              <description>The ADC skipping counter 1 skipping value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCC1SKSEL</name>
              <description>The ADC skipping counter 1 skipping source selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ADDINTSCTL0</name>
        <displayName>ADDINTSCTL0</displayName>
        <description>Additional interrupt skipping control register 0</description>
        <addressOffset>0x78</addressOffset>
        <size>0x20</size>
        <resetValue>0x0FF000FF</resetValue>
        <fields>
            <field>
              <name>ADDC2VAL</name>
              <description>This bit-field indicates the current additional interrupt skipping counter 2 value.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDC2IVAL</name>
              <description>The additional interrupt skipping counter 2 Initial value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDC2SVAL</name>
              <description>The additional interrupt skipping counter 2 skipping value</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDC2SKSEL</name>
              <description>The additional interrupt skipping counter 2 skipping source selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDC1VAL</name>
              <description>This bit-field indicates the current additional interrupt skipping counter 1 value.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDC1IVAL</name>
              <description>The additional interrupt skipping counter 1 Initial value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDC1SVAL</name>
              <description>The additional interrupt skipping counter 1 skipping value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDC1SKSEL</name>
              <description>The additional interrupt skipping counter 1 skipping source selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ADDINTSCTL1</name>
        <displayName>ADDINTSCTL1</displayName>
        <description>Additional interrupt skipping control register 1</description>
        <addressOffset>0x7C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000001</resetValue>
        <fields>
            <field>
              <name>ADT2AISSEL</name>
              <description>The trigger signal generated by ADTCV2[15:0] additional interrupt skipping function selection.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADT1AISSEL</name>
              <description>The trigger signal generated by ADTCV1[15:0] additional interrupt skipping function selection.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFAISSEL</name>
              <description>Overflow additional interrupt skipping function selection.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UFAISSEL</name>
              <description>Underflow additional interrupt skipping function selection.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1ADDAISSEL</name>
              <description>The channel 1 additional value compare match additional interrupt skipping function selection.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0ADDAISSEL</name>
              <description>The channel 0 additional value compare match additional interrupt skipping function selection.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1AISSEL</name>
              <description>The channel 1 input capture/compare match additional interrupt skipping function selection.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0AISSEL</name>
              <description>The channel 0 input capture/compare match additional interrupt skipping function selection.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
