burakenez/gd32m53x-cmake-vscode/Examples/EVIC/cmp_trigger_group_intput_capture/GD32M53x.svd
      <register>
        <name>IADCTSS</name>
        <displayName>IADCTSS</displayName>
        <description>Interrupt and ADC trigger signal skipping register</description>
        <addressOffset>0x80</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>OUFINTSC</name>
              <description>Overflow / underflow interrupt skipping counter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADT2INTSL</name>
              <description>The trigger signal generated by ADTCV2[15:0] interrupt skipping link</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADT1INTSL</name>
              <description>The trigger signal generated by ADTCV1[15:0] interrupt skipping link</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUFINTSVAL</name>
              <description>The number of overflow / underflow interrupt skipping value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUFINTSSEL</name>
              <description>Overflow / underflow interrupt skip selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1AINTSL</name>
              <description>The channel 1 additional value compare match interrupt skipping link</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0AINTSL</name>
              <description>The channel 0 additional value compare match interrupt skipping link</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1INTSL</name>
              <description>The channel 1 input capture/compare match interrupt skipping link</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0INTSL</name>
              <description>The channel 0 input capture/compare match interrupt skipping link</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CREP</name>
        <displayName>CREP</displayName>
        <description>Counter repetition register</description>
        <addressOffset>0x84</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CREPRLD</name>
              <description>The repeat counter is loaded immediately</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CREPCNT</name>
              <description>Repeat counter current value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CREP</name>
              <description>Counter repetition value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SYNRSTCTL</name>
        <displayName>SYNRSTCTL</displayName>
        <description>Synchronous reset control register</description>
        <addressOffset>0x88</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>SYNCSSEL</name>
              <description>GPTIMER synchronization control set selection</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHSRETEN</name>
              <description>Channel input as the other GPTIMER synchronization reset source enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNDRETEN</name>
              <description>Underflow as the other GPTIMER synchronization reset source enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRETEN</name>
              <description>Overflow as the other GPTIMER synchronization reset source enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1ARETEN</name>
              <description>Channel 1 additional value compare match as the other GPTIMER synchronization reset source enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0ARETEN</name>
              <description>Channel 0 additional value compare match as the other GPTIMER synchronization reset source enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1RETEN</name>
              <description>Channel 1 compare match / input capture as the other GPTIMER synchronization reset source enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0RETEN</name>
              <description>Channel 0 compare match / input capture as the other GPTIMER synchronization reset source enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DMACFG</name>
        <displayName>DMACFG</displayName>
        <description>DMA configuration register</description>
        <addressOffset>0xE0</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DMATC</name>
              <description>DMA transfer count</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMATA</name>
              <description>DMA transfer access start address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DMATB</name>
        <displayName>DMATB</displayName>
        <description>DMA transfer buffer register</description>
        <addressOffset>0xE4</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DMATB</name>
              <description>DMA transfer buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CFG</name>
        <displayName>CFG</displayName>
        <description>Configuration register</description>
        <addressOffset>0xFC</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CHVSEL</name>
              <description>Write CHxVAL register selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
