burakenez/gd32m53x-cmake-vscode/Examples/EVIC/cmp_trigger_group_intput_capture/GD32M53x.svd
    </registers>
</peripheral>
    <peripheral derivedFrom="GPTIMER0">
      <name>GPTIMER1</name>
      <groupName>GPTIMER</groupName>
      <baseAddress>0x40016100</baseAddress>
      <interrupt>
        <name>GPTIMER1</name>
        <description>GPTIMER1 global interrupt</description>
        <value>50</value>
      </interrupt>
    </peripheral>
<peripheral>
    <name>GTOC</name>
    <description>GPTIMER Output Controller</description>
    <groupName>GTOC</groupName>
    <baseAddress>0x48004800</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GTOC0</name>
        <value>79</value>
      </interrupt>
      <interrupt>
        <name>GTOC1</name>
        <value>80</value>
      </interrupt>
      <interrupt>
        <name>GTOC2</name>
        <value>81</value>
      </interrupt>
      <interrupt>
        <name>GTOC3</name>
        <value>82</value>
      </interrupt>
      <registers>
        <register>
          <name>CFG0</name>
          <displayName>CFG0</displayName>
          <description>Configuration Register 0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DFSCDIV_0_1</name>
              <description>GTOCx digital filter sampling clock division</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFEN</name>
              <description>GTOCx digital filter enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPL</name>
              <description>Polarity of GTOCx_IN input</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFSNUM</name>
              <description>GTOCx digital filter sampling number</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDM</name>
              <description>GTOCx_IN input detection mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFSCDIV_2_3</name>
              <description>Refer to DFSCDIV[1:0] bits.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWOCRG</name>
              <description>Software output closing request generation</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMERETIS</name>
              <description>GPTIMER external trigger input x status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMP3EDEN</name>
              <description>CMP3 valid edge detection enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP2EDEN</name>
              <description>CMP2 valid edge detection enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP1EDEN</name>
              <description>CMP1 valid edge detection enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP0EDEN</name>
              <description>CMP0 valid edge detection enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKUPDEN</name>
              <description>CPU LOCKUP detection enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HXTALSDEN</name>
              <description>HXTAL stuck detection enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMERFDEN</name>
              <description>GPTIMER output fault detection enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDEN</name>
              <description>GTOCx_IN input detection enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKUPDF</name>
              <description>CPU LOCKUP detection flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HXTALSDF</name>
              <description>HXTAL stuck detection flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFVEIF</name>
              <description>GPTIMER output fault or CMP valid edge interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INIF</name>
              <description>GTOCx_IN input interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
            <register>
        <name>OCRCTL0</name>
        <displayName>OCRCTL0</displayName>
        <description>GTOC0 output closing request control regist 0</description>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>OCRMKSEL</name>
              <description>Output closing request mask source selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>WP0</name>
        <displayName>WP0</displayName>
        <description>GTOCx write protection regist 0</description>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>WPKEY</name>
              <description>Write protect key</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WREN</name>
              <description>GTOCx_ECRCTL register write enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ECRCTL0</name>
        <displayName>ECRCTL0</displayName>
        <description>GTOC0 extended closing request control regist 0</description>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>ECRMKSEL</name>
              <description>Extended closing request mask source selection</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECRVLSEL</name>
              <description>Extended closing request valid level selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECRSSEL</name>
              <description>Extended closing request source selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECREN</name>
              <description>Extended closing request enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
            <register>
        <name>CFG1</name>
        <displayName>CFG1</displayName>
        <description>GTOC1 configuration regist 1</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DFSCDIV_0_1</name>
              <description>GTOCx digital filter sampling clock division</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFEN</name>
              <description>GTOCx digital filter enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPL</name>
              <description>Polarity of GTOCx_IN input</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFSNUM</name>
              <description>GTOCx digital filter sampling number</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDM</name>
              <description>GTOCx_IN input detection mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFSCDIV_2_3</name>
              <description>GTOC digital filter sampling clock division.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWOCRG</name>
              <description>Software output closing request generation</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMERETIS</name>
              <description>GPTIMER external trigger input x status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMP3EDEN</name>
              <description>CMP3 valid edge detection enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP2EDEN</name>
              <description>CMP2 valid edge detection enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP1EDEN</name>
              <description>CMP1 valid edge detection enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP0EDEN</name>
              <description>CMP0 valid edge detection enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKUPDEN</name>
              <description>CPU LOCKUP detection enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HXTALSDEN</name>
              <description>HXTAL stuck detection enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMERFDEN</name>
              <description>GPTIMER output fault detection enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDEN</name>
              <description>GTOCx_IN input detection enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKUPDF</name>
              <description>CPU LOCKUP detection flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HXTALSDF</name>
              <description>HXTAL stuck detection flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFVEIF</name>
              <description>GPTIMER output fault or CMP valid edge interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INIF</name>
              <description>GTOCx_IN input interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>OCRCTL1</name>
        <displayName>OCRCTL1</displayName>
        <description>GTOC1 output closing request control regist 1</description>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>OCRMKSEL</name>
              <description>Output closing request mask source selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>WP1</name>
        <displayName>WP1</displayName>
        <description>GTOC1 write protection regist 1</description>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>WPKEY</name>
              <description>Write protect key</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WREN</name>
              <description>GTOCx_ECRCTL register write enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ECRCTL1</name>
        <displayName>ECRCTL1</displayName>
        <description>GTOC1 extended closing request control regist 1</description>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>ECRMKSEL</name>
              <description>Extended closing request mask source selection</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECRVLSEL</name>
              <description>Extended closing request valid level selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECRSSEL</name>
              <description>Extended closing request source selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECREN</name>
              <description>Extended closing request enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
