burakenez/gd32m53x-cmake-vscode/Examples/EVIC/cmp_trigger_group_intput_capture/GD32M53x.svd
    </registers>
</peripheral>
<peripheral>
    <name>POC</name>
    <description>Port Output Controller</description>
    <groupName>POC</groupName>
    <baseAddress>0x48004400</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
    <interrupt>
        <name>POC</name>
        <value>77</value>
      </interrupt>
    <registers>
      <register>
        <name>STAT0</name>
        <displayName>STAT0</displayName>
        <description>Status register 0</description>
        <addressOffset>0x00</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TIMER7_CCIF</name>
              <description>TIMER7 concurrent conduction interrupt flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_CCIF</name>
              <description>TIMER0 concurrent conduction interrupt flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKUPDF</name>
              <description>CPU LOCKUP detection flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HXTALSDF</name>
              <description>HXTAL stuck detection flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN5IF</name>
              <description>POC_IN5 input interrupt flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN4IF</name>
              <description>POC_IN4 input interrupt flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN3IF</name>
              <description>POC_IN3 input interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN2IF</name>
              <description>POC_IN2 input interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN1IF</name>
              <description>POC_IN1 input interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN0IF</name>
              <description>POC_IN0 input interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>IN0DCFG</name>
        <displayName>IN0DCFG</displayName>
        <description>Input n detection configuration regist 0</description>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000200</resetValue>
        <fields>
            <field>
              <name>INPL</name>
              <description>Polarity of POC_INn pin input</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDREN</name>
              <description>POC_INn disabling request enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INIE</name>
              <description>POC_INn input interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDSNUM</name>
              <description>POC_INn input detection sampling number</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDMSEL</name>
              <description>POC_INn input detection mode selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>IN1DCFG</name>
        <displayName>IN1DCFG</displayName>
        <description>Input n detection configuration regist 1</description>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000200</resetValue>
        <fields>
            <field>
              <name>INPL</name>
              <description>Polarity of POC_INn pin input</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDREN</name>
              <description>POC_INn disabling request enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INIE</name>
              <description>POC_INn input interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDSNUM</name>
              <description>POC_INn input detection sampling number</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDMSEL</name>
              <description>POC_INn input detection mode selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>IN2DCFG</name>
        <displayName>IN2DCFG</displayName>
        <description>Input n detection configuration regist 2</description>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000200</resetValue>
        <fields>
            <field>
              <name>INPL</name>
              <description>Polarity of POC_INn pin input</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDREN</name>
              <description>POC_INn disabling request enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INIE</name>
              <description>POC_INn input interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDSNUM</name>
              <description>POC_INn input detection sampling number</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDMSEL</name>
              <description>POC_INn input detection mode selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>IN3DCFG</name>
        <displayName>IN3DCFG</displayName>
        <description>Input n detection configuration regist 3</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000200</resetValue>
        <fields>
            <field>
              <name>INPL</name>
              <description>Polarity of POC_INn pin input</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDREN</name>
              <description>POC_INn disabling request enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INIE</name>
              <description>POC_INn input interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDSNUM</name>
              <description>POC_INn input detection sampling number</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDMSEL</name>
              <description>POC_INn input detection mode selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>IN4DCFG</name>
        <displayName>IN4DCFG</displayName>
        <description>Input n detection configuration regist 4</description>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000200</resetValue>
        <fields>
            <field>
              <name>INPL</name>
              <description>Polarity of POC_INn pin input</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDREN</name>
              <description>POC_INn disabling request enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INIE</name>
              <description>POC_INn input interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDSNUM</name>
              <description>POC_INn input detection sampling number</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDMSEL</name>
              <description>POC_INn input detection mode selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>IN5DCFG</name>
        <displayName>IN5DCFG</displayName>
        <description>Input n detection configuration regist 5</description>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000200</resetValue>
        <fields>
            <field>
              <name>INPL</name>
              <description>Polarity of POC_INn pin input</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDREN</name>
              <description>POC_INn disabling request enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INIE</name>
              <description>POC_INn input interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDSNUM</name>
              <description>POC_INn input detection sampling number</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDMSEL</name>
              <description>POC_INn input detection mode selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTL0</name>
        <displayName>CTL0</displayName>
        <description>Control register 0</description>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LOCKUP_DREN</name>
              <description>CPU LOCKUP disabling request enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HXTALS_DREN</name>
              <description>HXTAL stuck disabling request enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SWDRG</name>
        <displayName>SWDRG</displayName>
        <description>Software disabling request generation register</description>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>GPTIMER1_SWDRG</name>
              <description>Software disabling request generation for GPTIMER1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER0_SWDRG</name>
              <description>Software disabling request generation for GPTIMER0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_SWDRG</name>
              <description>Software disabling request generation for TIMER2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_SWDRG</name>
              <description>Software disabling request generation for TIMER1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER7_SWDRG</name>
              <description>Software disabling request generation for TIMER7</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_SWDRG</name>
              <description>Software disabling request generation for TIMER0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CDCFG0</name>
        <displayName>CDCFG0</displayName>
        <description>Complementary detection configuration register 0</description>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TIMER0_CCDREN</name>
              <description>TIMER0 concurrent conduction disabling request enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_CCIE</name>
              <description>TIMER0 concurrent conduction interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_PSELEN</name>
              <description>TIMER0 polarity selection enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_MCH2_APSEL</name>
              <description>TIMER0_MCH2 active polarity selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_CH2_APSEL</name>
              <description>TIMER0_CH2 active polarity selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_MCH1_APSEL</name>
              <description>TIMER0_MCH1 active polarity selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_CH1_APSEL</name>
              <description>TIMER0_CH1 active polarity selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_MCH0_APSEL</name>
              <description>TIMER0_MCH0 active polarity selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_CH0_APSEL</name>
              <description>TIMER0_CH0 active polarity selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CDCFG1</name>
        <displayName>CDCFG1</displayName>
        <description>Complementary detection configuration register 1</description>
        <addressOffset>0x2C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TIMER7_CCDREN</name>
              <description>TIMER7 concurrent conduction disabling request enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER7_CCIE</name>
              <description>TIMER7 concurrent conduction interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER7_PSELEN</name>
              <description>TIMER7 polarity selection enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER7_MCH2_APSEL</name>
              <description>TIMER7_MCH2 active polarity selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER7_CH2_APSEL</name>
              <description>TIMER7_CH2 active polarity selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER7_MCH1_APSEL</name>
              <description>TIMER7_MCH1 active polarity selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER7_CH1_APSEL</name>
              <description>TIMER7_CH1 active polarity selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER7_MCH0_APSEL</name>
              <description>TIMER7_MCH0 active polarity selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER7_CH0_APSEL</name>
              <description>TIMER7_CH0 active polarity selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
