burakenez/gd32m53x-cmake-vscode/Examples/EVIC/cmp_trigger_group_intput_capture/GD32M53x.svd
      <register>
        <name>ODMODE0</name>
        <displayName>ODMODE0</displayName>
        <description>Output disable mode register 0</description>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
        <resetValue>0x00001515</resetValue>
        <fields>
            <field>
              <name>TIMER7_OSEL3</name>
              <description>Output selection for TIMER7_CH3/ TIMER7_MCH3 pin</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER7_OSEL2</name>
              <description>Output selection for TIMER7_CH2/ TIMER7_MCH2 pin</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER7_OSEL1</name>
              <description>Output selection for TIMER7_CH1/ TIMER7_MCH1 pin</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER7_OSEL0</name>
              <description>Output selection for TIMER7_CH0/ TIMER7_MCH0 pin</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_OSEL3</name>
              <description>Output selection for TIMER0_CH3/ TIMER0_MCH3 pin</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_OSEL2</name>
              <description>Output selection for TIMER0_CH2/ TIMER0_MCH2 pin</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_OSEL1</name>
              <description>Output selection for TIMER0_CH1/ TIMER0_MCH1 pin</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_OSEL0</name>
              <description>Output selection for TIMER0_CH0/ TIMER0_MCH0 pin</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ODMODE1</name>
        <displayName>ODMODE1</displayName>
        <description>Output disable mode register 1</description>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>GPTIMER1_OSEL1</name>
              <description>Output selection for GPTIMER1_CH1 pin</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER1_OSEL0</name>
              <description>Output selection for GPTIMER1_CH0 pin</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER0_OSEL1</name>
              <description>Output selection for GPTIMER0_CH1 pin</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER0_OSEL0</name>
              <description>Output selection for GPTIMER0_CH0 pin</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_OSEL3</name>
              <description>Output selection for TIMER2_CH3 pin</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_OSEL2</name>
              <description>Output selection for TIMER2_CH2 pin</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_OSEL1</name>
              <description>Output selection for TIMER2_CH1 pin</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_OSEL0</name>
              <description>Output selection for TIMER2_CH0 pin</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_OSEL3</name>
              <description>Output selection for TIMER1_CH3 pin</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_OSEL2</name>
              <description>Output selection for TIMER1_CH2 pin</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_OSEL1</name>
              <description>Output selection for TIMER1_CH1 pin</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_OSEL0</name>
              <description>Output selection for TIMER1_CH0 pin</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>REQSEL0</name>
        <displayName>REQSEL0</displayName>
        <description>Request selection register 0</description>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000201</resetValue>
        <fields>
            <field>
              <name>TIMER7_CMPDRSEL</name>
              <description>CMPn (n=0,1,2,3) disabling request select TIMER7</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER7_IN5DRSEL</name>
              <description>POC_IN5 disabling request select TIMER7</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER7_IN4DRSEL</name>
              <description>POC_IN4 disabling request select TIMER7</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER7_IN3DRSEL</name>
              <description>POC_IN3 disabling request select TIMER7</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER7_IN2DRSEL</name>
              <description>POC_IN2 disabling request select TIMER7</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER7_IN1DRSEL</name>
              <description>POC_IN1 disabling request select TIMER7</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER7_IN0DRSEL</name>
              <description>POC_IN0 disabling request select TIMER7</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_CMPDRSEL</name>
              <description>CMPn (n=0,1,2,3) disabling request select TIMER0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_IN5DRSEL</name>
              <description>POC_IN5 disabling request select TIMER0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_IN4DRSEL</name>
              <description>POC_IN4 disabling request select TIMER0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_IN3DRSEL</name>
              <description>POC_IN3 disabling request select TIMER0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_IN2DRSEL</name>
              <description>POC_IN2 disabling request select TIMER0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_IN1DRSEL</name>
              <description>POC_IN1 disabling request select TIMER0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_IN0DRSEL</name>
              <description>POC_IN0 disabling request select TIMER0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>REQSEL1</name>
        <displayName>REQSEL1</displayName>
        <description>Request selection register 1</description>
        <addressOffset>0x4C</addressOffset>
        <size>0x20</size>
        <resetValue>0x04042414</resetValue>
        <fields>
            <field>
              <name>GPTIMER1_CMPDRSEL</name>
              <description>CMPn (n=0,1,2,3) disabling request select GPTIMER1</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER1_IN5DRSEL</name>
              <description>POC_IN5 disabling request select GPTIMER1</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER1_IN4DRSEL</name>
              <description>POC_IN4 disabling request select GPTIMER1</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER1_IN3DRSEL</name>
              <description>POC_IN3 disabling request select GPTIMER1</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER1_IN2DRSEL</name>
              <description>POC_IN2 disabling request select GPTIMER1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER1_IN1DRSEL</name>
              <description>POC_IN1 disabling request select GPTIMER1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER1_IN0DRSEL</name>
              <description>POC_IN0 disabling request select GPTIMER1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER0_CMPDRSEL</name>
              <description>CMPn (n=0,1,2,3) disabling request select GPTIMER0</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER0_IN5DRSEL</name>
              <description>POC_IN5 disabling request select GPTIMER0</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER0_IN4DRSEL</name>
              <description>POC_IN4 disabling request select GPTIMER0</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER0_IN3DRSEL</name>
              <description>POC_IN3 disabling request select GPTIMER0</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER0_IN2DRSEL</name>
              <description>POC_IN2 disabling request select GPTIMER0</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER0_IN1DRSEL</name>
              <description>POC_IN1 disabling request select GPTIMER0</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER0_IN0DRSEL</name>
              <description>POC_IN0 disabling request select GPTIMER0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_CMPDRSEL</name>
              <description>CMPn (n=0,1,2,3) disabling request select TIMER2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_IN5DRSEL</name>
              <description>POC_IN5 disabling request select TIMER2</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_IN4DRSEL</name>
              <description>POC_IN4 disabling request select TIMER2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_IN3DRSEL</name>
              <description>POC_IN3 disabling request select TIMER2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_IN2DRSEL</name>
              <description>POC_IN2 disabling request select TIMER2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_IN1DRSEL</name>
              <description>POC_IN1 disabling request select TIMER2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_IN0DRSEL</name>
              <description>POC_IN0 disabling request select TIMER2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_CMPDRSEL</name>
              <description>CMPn (n=0,1,2,3) disabling request select TIMER1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_IN5DRSEL</name>
              <description>POC_IN5 disabling request select TIMER1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_IN4DRSEL</name>
              <description>POC_IN4 disabling request select TIMER1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_IN3DRSEL</name>
              <description>POC_IN3 disabling request select TIMER1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_IN2DRSEL</name>
              <description>POC_IN2 disabling request select TIMER1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_IN1DRSEL</name>
              <description>POC_IN1 disabling request select TIMER1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_IN0DRSEL</name>
              <description>POC_IN0 disabling request select TIMER1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>STAT1</name>
        <displayName>STAT1</displayName>
        <description>Status register 1</description>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CMP3DF</name>
              <description>Comparator 3 detection flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP2DF</name>
              <description>Comparator 2 detection flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP1DF</name>
              <description>Comparator 1 detection flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP0DF</name>
              <description>Comparator 0 detection flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTL1</name>
        <displayName>CTL1</displayName>
        <description>Control register 1</description>
        <addressOffset>0x64</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CMP3DREN</name>
              <description>Comparator 3 disabling request enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP2DREN</name>
              <description>Comparator 2 disabling request enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP1DREN</name>
              <description>Comparator 1 disabling request enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP0DREN</name>
              <description>Comparator 0 disabling request enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
