burakenez/gd32m53x-cmake-vscode/Examples/EVIC/cmp_trigger_group_intput_capture/GD32M53x.svd
      <register>
        <name>EXTCTL0</name>
        <displayName>EXTCTL0</displayName>
        <description>Extended control register 0</description>
        <addressOffset>0x68</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TIMER7_CMP3DREN</name>
              <description>Comparator 3 disabling request enable for TIMER7</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER7_CMP2DREN</name>
              <description>Comparator 2 disabling request enable for TIMER7</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER7_CMP1DREN</name>
              <description>Comparator 1 disabling request enable for TIMER7</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER7_CMP0DREN</name>
              <description>Comparator 0 disabling request enable for TIMER7</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_CMP3DREN</name>
              <description>Comparator 3 disabling request enable for TIMER0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_CMP2DREN</name>
              <description>Comparator 2 disabling request enable for TIMER0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_CMP1DREN</name>
              <description>Comparator 1 disabling request enable for TIMER0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_CMP0DREN</name>
              <description>Comparator 0 disabling request enable for TIMER0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>EXTCTL1</name>
        <displayName>EXTCTL1</displayName>
        <description>Extended control register 1</description>
        <addressOffset>0x6C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>GPTIMER1_CMP3DREN</name>
              <description>Comparator 3 disabling request enable for GPTIMER1</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER1_CMP2DREN</name>
              <description>Comparator 2 disabling request enable for GPTIMER1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER1_CMP1DREN</name>
              <description>Comparator 1 disabling request enable for GPTIMER1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER1_CMP0DREN</name>
              <description>Comparator 0 disabling request enable for GPTIMER1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER0_CMP3DREN</name>
              <description>Comparator 3 disabling request enable for GPTIMER0</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER0_CMP2DREN</name>
              <description>Comparator 2 disabling request enable for GPTIMER0</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER0_CMP1DREN</name>
              <description>Comparator 1 disabling request enable for GPTIMER0</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTIMER0_CMP0DREN</name>
              <description>Comparator 0 disabling request enable for GPTIMER0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_CMP3DREN</name>
              <description>Comparator 3 disabling request enable for TIMER2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_CMP2DREN</name>
              <description>Comparator 2 disabling request enable for TIMER2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_CMP1DREN</name>
              <description>Comparator 1 disabling request enable for TIMER2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_CMP0DREN</name>
              <description>Comparator 0 disabling request enable for TIMER2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_CMP3DREN</name>
              <description>Comparator 3 disabling request enable for TIMER1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_CMP2DREN</name>
              <description>Comparator 2 disabling request enable for TIMER1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_CMP1DREN</name>
              <description>Comparator 1 disabling request enable for TIMER1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_CMP0DREN</name>
              <description>Comparator 0 disabling request enable for TIMER1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>IN0DMK</name>
        <displayName>IN0DMK</displayName>
        <description>Input n detection mask regist 0</description>
        <addressOffset>0x70</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>INMKSEL</name>
              <description>POC_INn input detection mask source selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>IN1DMK</name>
        <displayName>IN1DMK</displayName>
        <description>Input n detection mask regist 1</description>
        <addressOffset>0x74</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>INMKSEL</name>
              <description>POC_INn input detection mask source selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>IN2DMK</name>
        <displayName>IN2DMK</displayName>
        <description>Input n detection mask regist 2</description>
        <addressOffset>0x78</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>INMKSEL</name>
              <description>POC_INn input detection mask source selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>IN3DMK</name>
        <displayName>IN3DMK</displayName>
        <description>Input n detection mask regist 3</description>
        <addressOffset>0x7c</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>INMKSEL</name>
              <description>POC_INn input detection mask source selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>IN4DMK</name>
        <displayName>IN4DMK</displayName>
        <description>Input n detection mask regist 4</description>
        <addressOffset>0x80</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>INMKSEL</name>
              <description>POC_INn input detection mask source selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>IN5DMK</name>
        <displayName>IN5DMK</displayName>
        <description>Input n detection mask regist 5</description>
        <addressOffset>0x84</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>INMKSEL</name>
              <description>POC_INn input detection mask source selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CMP0DMK</name>
        <displayName>CMP0DMK</displayName>
        <description>Comparator n detection mask regist 0</description>
        <addressOffset>0x90</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CMPMKSEL</name>
              <description>Comparator n output detection mask source selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CMP1DMK</name>
        <displayName>CMP1DMK</displayName>
        <description>Comparator n detection mask regist 1</description>
        <addressOffset>0x94</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CMPMKSEL</name>
              <description>Comparator n output detection mask source selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CMP2DMK</name>
        <displayName>CMP2DMK</displayName>
        <description>Comparator n detection mask regist 2</description>
        <addressOffset>0x98</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CMPMKSEL</name>
              <description>Comparator n output detection mask source selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CMP3DMK</name>
        <displayName>CMP3DMK</displayName>
        <description>Comparator n detection mask regist 3</description>
        <addressOffset>0x9c</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CMPMKSEL</name>
              <description>Comparator n output detection mask source selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
