burakenez/gd32m53x-cmake-vscode/Examples/EVIC/cmp_trigger_group_intput_capture/GD32M53x.svd
      <register>
        <name>CFG5</name>
        <displayName>CFG5</displayName>
        <description>Configuration register 5</description>
        <addressOffset>0x54</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>FLASH_LOCK</name>
              <description>Flash ECC multi-bit error lock.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASHSRAM_LOCK</name>
              <description>Flash SRAM ECC multi-bit error lock.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CANFILTER_LOCK</name>
              <description>CAN filter ECC multi-bit error lock</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CANRX_LOCK</name>
              <description>CAN receive FIFO ECC multi-bit error lock</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM_LOCK</name>
              <description>SRAM ECC multi-bit error lock.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LVD_LOCK</name>
              <description>Low voltage detector lock.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKUP_LOCK</name>
              <description>Cortex-M33 lockup (Hardfault) output lock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SRAMCFG</name>
        <displayName>SRAMCFG</displayName>
        <description>SRAM configuration register</description>
        <addressOffset>0x68</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000003</resetValue>
        <fields>
            <field>
              <name>SRAM_REMAP_SEL</name>
              <description>This bit is used to control the size of SRAM aliased in 0x1000 0000 (remap of SRAM in 0x2000 0000). The CPU can access and SRAM aliased in 0x1000 0000 via CBUS instead of SBUS.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>PRCFG</name>
        <displayName>PRCFG</displayName>
        <description>Protection configuration register</description>
        <addressOffset>0x6C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>PRKEY</name>
              <description>Protect area write key.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRCFG2</name>
              <description>Protect configuration select 2.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRCFG1</name>
              <description>Protect configuration select 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRCFG0</name>
              <description>Protect configuration select 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
 <register>
          <name>TADSRCFG</name>
          <displayName>TADSRCFG</displayName>
          <description>TIMERx ADC Start Request configuration Register</description>
          <addressOffset>0x070</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADCSM2EN</name>
              <description>ADCSM2 pin output enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCSM2SEL</name>
              <description>Select the ADC trigger source connected to ADCSM1 pin</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCSM1EN</name>
              <description>ADCSM1 pin output enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCSM1SEL</name>
              <description>Select the ADC trigger source connected to ADCSM1 pin</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER0CFG0</name>
          <displayName>TIMER0CFG0</displayName>
          <description>TIMER0 configuration register 0</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSCFG5</name>
              <description>Event mode configuration</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG4</name>
              <description>Pause mode configuration</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG3</name>
              <description>Restart mode configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG2</name>
              <description>Quadrature decoder mode 2 configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG1</name>
              <description>Quadrature decoder mode 1 configuration</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG0</name>
              <description>Quadrature decoder mode 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER7CFG0</name>
          <displayName>TIMER7CFG0</displayName>
          <description>TIMER7 configuration register 0</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSCFG5</name>
              <description>Event mode configuration</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG4</name>
              <description>Pause mode configuration</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG3</name>
              <description>Restart mode configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG2</name>
              <description>Quadrature decoder mode 2 configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG1</name>
              <description>Quadrature decoder mode 1 configuration</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG0</name>
              <description>Quadrature decoder mode 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER0CFG1</name>
          <displayName>TIMER0CFG1</displayName>
          <description>TIMER0 configuration register 1</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSCFG11</name>
              <description>TSCFG11</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG10</name>
              <description>TSCFG10</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG9</name>
              <description>TSCFG9</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG7</name>
              <description>Restart / event mode configuration</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG6</name>
              <description>External clock mode 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER7CFG1</name>
          <displayName>TIMER7CFG1</displayName>
          <description>TIMER7 configuration register 1</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSCFG11</name>
              <description>TSCFG11</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG10</name>
              <description>TSCFG10</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG9</name>
              <description>TSCFG9</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG7</name>
              <description>Restart / event mode configuration</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG6</name>
              <description>External clock mode 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER0CFG2</name>
          <displayName>TIMER0CFG2</displayName>
          <description>TIMER0 configuration register 2</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSCFG15</name>
              <description>Internal trigger input source configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG12</name>
              <description>Internal trigger input source configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER7CFG2</name>
          <displayName>TIMER7CFG2</displayName>
          <description>TIMER7 configuration register 2</description>
          <addressOffset>0x12C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSCFG15</name>
              <description>Internal trigger input source configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG12</name>
              <description>Internal trigger input source configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER1CFG0</name>
          <displayName>TIMER1CFG0</displayName>
          <description>TIMER1 configuration register 0</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSCFG5</name>
              <description>Event mode configuration</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG4</name>
              <description>Pause mode configuration</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG3</name>
              <description>Restart mode configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG2</name>
              <description>Quadrature decoder mode 2 configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG1</name>
              <description>Quadrature decoder mode 1 configuration</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG0</name>
              <description>Quadrature decoder mode 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="SYSCFG.TIMER1CFG0">
          <name>TIMER2CFG0</name>
          <displayName>TIMER2CFG0</displayName>
          <description>TIMER2 configuration register 0</description>
          <addressOffset>0x118</addressOffset>
        </register>
        <register>
          <name>TIMER1CFG1</name>
          <displayName>TIMER1CFG1</displayName>
          <description>TIMER1 configuration register 1</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSCFG11</name>
              <description>TSCFG11</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG10</name>
              <description>TSCFG10</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG9</name>
              <description>Non-quadrature decoder mode 1 configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG7</name>
              <description>Restart / event mode configuration</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG6</name>
              <description>External clock mode 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="SYSCFG.TIMER1CFG1">
          <name>TIMER2CFG1</name>
          <displayName>TIMER2CFG1</displayName>
          <description>TIMER2 configuration register 1</description>
          <addressOffset>0x11C</addressOffset>
        </register>
        <register>
          <name>TIMER1CFG2</name>
          <displayName>TIMER1CFG2</displayName>
          <description>TIMER1 configuration register 2</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSCFG15</name>
              <description>Internal trigger input source configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG12</name>
              <description>Internal trigger input source configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="SYSCFG.TIMER1CFG2">
          <name>TIMER2CFG2</name>
          <displayName>TIMER2CFG2</displayName>
          <description>TIMER2 configuration register 2</description>
          <addressOffset>0x120</addressOffset>
        </register>
        <register>
          <name>CFG6</name>
          <displayName>CFG6</displayName>
          <description>configuration register 6</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CK_CMP_SEL</name>
              <description>CK_CMP select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
